["Hey! It's my first day of my life being written by a handful of internet users. I sure hope I make it past 25 years old before I get mauled to death by a giant floating space-tiger or something.","not entirely sure what to write today - you can never be sure who's reading these sorts of things, especially now. gotta be very ca","Sorry about that. I had to cut that last entry short to prevent a no longer imminent disaster.","Dear diary, it's currently 11:05 on a Saturday evening and I'm hunched over this journal in a public restroom waiting for...nothing? Earlier today my boss had fired me, my mom had kicked me out since \"I wasn't doing anything for the family.\" and now I'm sitting here with my packed suitcase in a restroom somewhere. Greeeeeaaaaaaat, just perfect. What the fuck will I do now. Can someone just hold me and tell me everything is okay, I wish I had someone to be there for me. If I did, I wouldn't be here in this public restroom writing in a diary about how much I fucked up. Have a fucking awful day if you reading this.\r\nSincerely,\r\nthe life failing fucked up high school drop out whos name is apparently Max.","I am at a loss as what to do or where to go. There are only three places that I could possibly go that would work: My aunt's, the city's single homeless shelter, and the woods outside the city. My aunt would probably cuss me out and after returning me to my mother, cuss her out too, so I'd be back to square one, might get a free meal out of it though. The shelter wouldn't take me because I am an adult, which is a bit fucked up but whatever. And finally, the woods. I know of a shack that has working gas and running water. It's kinda unbelievable, but I'm pretty sure that the government pays for it all and has forgotten about it. The only issues are that it would take a bit to get to and the lack of food.\r\nI'll make my mind up by tomorrow. \r\n\r\nWhile writing today, I noticed that it feels wrong to write these in the first person. I don't know what it is exactly, but it just feels weird.","Dear Diary:\r\nToday, I decided to pawn my suitcase. With the new money, I bought a more lightweight bag satchel thing to carry my stuff (well, actually I bought this before I sold the suitcase, because carrying my stuff to the nearest shop would have been a bit uncomfortable, and then went to the convenience store to get some Jerk-ee Linx (TM) and a bag of generic-brand crisps (you know, like how acetaminophen is the generic brand of non-opiate pain meds?) I also bought a can of pepper spray, choosing the black can over the pink one (pink because civilian-owned pepper spray isn't feminine enough, I guess) before heading out to the woods. I was at the shack in the afternoon, one I had seen while playing with my friends when I was a kid. We would play \"house\" there, due to the remarkably useful prop. It's cut off from the rest of the woods, and I'm not really sure the purpose of it. It's got a woody, cedar-y smell, greyed with age and lichen and moss, and it's supported by stilts connected by a lattice wrapping around the base. I'm pretty sure an animal lives under there- there were mammalian footprints leading under the house, and a few bones that seemed to belong to a small rodent. At the top of the fragile, creaky stairs is a cramped porch-thing, covered by an extension of the roof just wide enough to keep the lone light bulb underneath dry. There was a mat on the porch when I was little, but it seems to have been stolen. Despite its dilapidated appearance, the shack is quite remarkable: none of the windows are broken, and despite its shotgun-home style, just going straight for 10 yards before the back wall of the house is reached, in the center is a supporting column/wall with a door leading into it. The door somehow looks older than the rest of the house, and was even there when I was little, although it was always locked.\r\nI got a rusty drink from the sink before sitting against the wall, partially to think, and partially to write this. I'm not sure what I'm going to do now. Even with my suitcase pawned, I still don't have that much money left, but I'm definitely not returning to my family. They're not safe. I need a job, but I'm not sure who would hire me, considering that I'm technically homeless. I'm so fucked. At least I currently have food, water and shelter. What happens when I run out of food? What happens if someone else lives here?"]